# -*- coding: utf-8 -*-
# Завдання для самоперевірки: Умови та цикли
# ==============================================

print("=== ЗАВДАННЯ 1: Перевірка віку ===")
# Напишіть програму, яка запитує вік користувача та виводить:
# - "Дитина" якщо вік менше 12
# - "Підліток" якщо вік від 12 до 17 включно
# - "Дорослий" якщо вік 18 або більше

#age = int(input("Введіть ваш вік: "))
# if age < 12:
#     print("Дитина")
# elif age >= 12 and age <= 17:   
#     print("Підліток")
# else:
#     print("Дорослий")

print("\n=== ЗАВДАННЯ 2: Парне чи непарне число ===")
# Напишіть програму, яка перевіряє, чи є число парним чи непарним
#number = int(input("Введіть число: "))
# if number % 2 == 0:
#    print("Парне число")
# else:
#    print("непарне число")

print("\n=== ЗАВДАННЯ 3: Калькулятор оцінок ===")
# Напишіть програму, яка за бали (0-100) виводить оцінку:
# 90-100: "Відмінно"
# 80-89: "Добре" 
# 70-79: "Задовільно"
# 60-69: "Незадовільно"
# менше 60: "Погано"

#score = int(input("Введіть кількість балів (0-100): "))
# if 90<= score <=100:
#     print("Відмінно")
# elif 80<= score <=89:
#     print("Добре")
# elif 70<= score <=79:
#     print("Задовільно")
# elif 60<= score <=69:
#     print("Незадовільно")
# else:
#     print("Погано")


print("\n=== ЗАВДАННЯ 4: Таблиця множення ===")
# Використовуючи цикл for та range(), виведіть таблицю множення на 5
# від 5×1 до 5×10


# for i in range(1,11):
#     print(f"Таблиця множення {i} на 5:", "дорівнює", i*5)


print("\n=== ЗАВДАННЯ 5: Сума чисел ===")
# Використовуючи цикл while, обчисліть суму всіх чисел від 1 до 50

# sum_result = 0
# counter = 1
# while counter <= 50:
#       sum_result += counter
#       counter +=1
# print(f"Сума чисел від 1 до 50: {sum_result}")
    

print("\n=== ЗАВДАННЯ 6: Підрахунок цифр у числі ===")
# Підрахуйте кількість цифр у числі, використовуючи цикл while

# number = int(input("Введіть число: "))
# original_number = number
# digit_count = 0

# if original_number == 0:
#     digit_count = 1
# else:
#     while original_number > 0:
#         original_number //= 10 
#         digit_count += 1
# print(f"Кількість цифр у числі {number}: {digit_count}")


print("\n=== ЗАВДАННЯ 7: Виведення символів рядка ===")
# Виведіть кожен символ рядка на окремому рядку, використовуючи цикл for

# text = input("Введіть рядок: ")
# for char in text:
#     print(char)


print("\n=== ЗАВДАННЯ 8: Пошук першого парного числа ===")
# Знайдіть перше парне число у діапазоні від 15 до 25, використовуючи break

# print("Шукаємо перше парне число від 15 до 25:")
# for i in range(15, 26):
#     if i % 2 == 0 :
#        print("Перше парне =", i)
#        break
#     print(i)


print("\n=== ЗАВДАННЯ 9: Пропуск непарних чисел ===")
# Виведіть тільки парні числа від 1 до 20, використовуючи continue

# print("Парні числа від 1 до 20:")
# for i in range(1,21):
#     if i % 2 == 0:
#         print(" even number =", i)
#         continue
#print(i)


print("\n=== ЗАВДАННЯ 10: Складна умова ===")
# Перевірте, чи може людина керувати автомобілем:
# - Вік >= 18 ТА має водійські права
# - АБО вік >= 16 ТА має водійські права ТА супроводжується дорослим

# age = int(input("Введіть вік: "))
# has_license = input("Чи є водійські права? (так/ні): ").lower() == "так"
# has_adult_supervision = input("Чи є супровід дорослого? (так/ні): ").lower() == "так"

# if age >= 18 and has_license:
#     print("Водій")
# elif age >= 16 and has_license and  has_adult_supervision:
#     print("Водій із супроводом")
# else:
#     print("Водій без прав")

print("\n=== ЗАВДАННЯ 11: Відгадування числа ===")
# Створіть просту гру "відгадай число"
# Загадане число: 42
# Користувач має 5 спроб

secret_number = 42
attempts = 5

while attempts > 0:
    s_number = int(input(f"\nВведіть число (залишилось {attempts} спроб): "))
    if s_number == secret_number:
        print("You guessed, great!")
        break
    attempts = attempts - 1
    if attempts > 0:
       print(f" Число не вірне, У вас {attempts} спроб.")
    else:
     print("Спроби закінчились, ви не вгадали")


print("\n=== ЗАВДАННЯ 12: Піраміда зірочок ===")
# Виведіть піраміду з зірочок висотою 5 рядків:
# *
# **
# ***
# ****
# *****
# star = 5
# for i in range(1, star +1):
#       print(i * "*")