# task 01 == Виправте синтаксичні помилки
print("Hello,", end = " ")
print("world!")

# task 02  == Виправте назви змінних, щоб текст виводався
hello = "Hello,"
world = "world"
print(f"{hello} {world}!")

# task 03 == Зробіть так, щоб кількість бананів була
# завжди на чотири штуки більша, ніж яблук
apples = 2
banana = apples + 4
print("apples =", apples)
print("banana =", banana)

# task 04 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 05 == Порахуйте периметр фігури з task 04
# та виведіть його для користувача
print("storona_1 =", 1)
print("storona_2 =", 2)
print("storona_3 =", 3)
print("storona_4 =", 4)
perymetr = storona_1 + storona_2 + storona_3 + storona_4
print("perymetr =", perymetr)

 # Задачі 06 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі

# task 06
    #У Оксани було 20 марок із серії «Мистецтво» 
    #і 7 марок із серії «Звірі».
    #5 марок із серії «Мистецтво» та
    #1 марку із серії «Звірі» вона подарувала подружці. 
    #Скільки марок лишилось у Оксани?
mystetstvo = 20
zviri = 7
podaruvala_mystetstvo = 5
podaruvala_zviri= 1
print("У Оксани було", mystetstvo,"марок із серії «Мистецтво»", "і", zviri, "марок із серії «Звірі».")
print(podaruvala_mystetstvo, "марок із серії «Мистецтво» та", podaruvala_zviri, "марку із серії «Звірі» вона подарувала подружці.")
print("Скільки марок лишилось у Оксани?")
print("Відповідь: У Оксани залишилось", mystetstvo - podaruvala_mystetstvo, 
      "марок із серії 'Мистецтво' та", zviri - podaruvala_zviri, "марок із серії 'Звірі'" )

# task 07
    #У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
    #Скільки всього дерев посадили в саду?
yabluni = 4
grushi = yabluni + 5
slyvy = yabluni - 2
print("У саду посадили", yabluni, "яблуні. Груш на 5 більше яблунь, а слив - на 2 менше. Скільки всього дерев посадили в саду?")
print("Відповідь: Всього посадили", yabluni + grushi + slyvy, "древ")

# task 08
    #До обіда температура повітря була на 5 градусів вище нуля.
    #Після обіду температура опустилася на 10 градусів.
    #Надвечір потепліло на 4 градуси. Яка температура надвечір?
t_do_obidu = 5
t_pislya_obidu = t_do_obidu - 10
t_nadvechir = t_pislya_obidu + 4
print("До обіда температура повітря була на", t_do_obidu, "градусів вище нуля. Після обіду температура опустилася на 10 градусів.")
print("Надвечір потепліло на 4 градуси. Яка температура надвечір?")
print("Відповідь: Надвечір температура була", t_do_obidu - t_pislya_obidu + t_nadvechir, "градусів.")

# task 09
    #Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
    #1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
    #Скількі сьогодні дітей у театральному гуртку?
hlopchykiv = 24
divchatok = hlopchykiv / 2
zahvorily_hlopchykiv = 1
ne_pryshly_divchatok = 2
print("Взагалі у театральному гуртку - ", hlopchykiv, "хлопчики, а дівчаток - вдвічі менше.", 
      zahvorily_hlopchykiv, "хлопчик захворів та", ne_pryshly_divchatok,
      "дівчинки не прийшли сьогодні. Скількі сьогодні дітей у театральному гуртку?")
print("Відповідь: На театральному гуртку сьогодні", int((hlopchykiv - zahvorily_hlopchykiv) + (divchatok - ne_pryshly_divchatok)), "дітей")

# task 10
    #Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
    #а третя - як половина вартості першої та другої разом.
    #Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
knyzhka_1 = 8
knyzhka_2 = knyzhka_1 + 2
knyzhka_3 = (knyzhka_1 + knyzhka_2)/2
print("Перша книжка коштує", knyzhka_1, "грн., друга - на 2 грн. дороже, а третя - як половина вартості першої та другої разом.")
print("кільки будуть коштувати усі книги, якщо купити по одному примірнику?")
print("Відповідь: Книги коштуватимуть ", int(knyzhka_1 + knyzhka_2 + knyzhka_3), "грн")