# task 1. Знайдіть всі унікальні елементи в списку small_list
small_list = [3, 1, 4, 5, 2, 5, 3]
unique =  list(set(small_list))
print("всі унікальні елементи в списку:", unique)


# task 2. Знайдіть середнє арифметичне всіх елементів у списку small_list
print("середнє арифметичне всіх елементів у списку:", sum(small_list)/len(small_list))



# task 3. Перевірте, чи є в списку big_list дублікати
big_list = [3, 5, -2, -1, -3, 0, 1, 4, 5, 2]
unique_1 =  list(set(big_list))
print("Big list:", unique_1)
duplicates = len(big_list) != unique_1
print("чи є в списку big_list дублікати:", duplicates)

# task 4. Знайдіть ключ з максимальним значенням у словнику add_dict
base_dict = {'contry':'Ukraine', 'continent': 'Europe', 'size': 123}
add_dict = {"a":1, "b":2, "c":2, "d":3, 'size': 12}


# task 5. Створіть новий словник, в якому ключі та значення base_dict будуть
# замінені місцями ({'Ukraine':'contry'...})

# task 6. Об'єднайте два словника base_dict та add_dict  в новий словник sum_dict
# Якщо ключі збігаються, то перетворіть значення в строку та об'єднайте їх
sum_dict = {}

# task 7.
line = "Створіть множину всіх символів, які входять у заданий рядок"
set_string = set(line)
print("множина всіх символів:", set_string)


# task 8. Обчисліть суму елементів двох множин, які не є спільними
set_1 = {1, 2, 3, 4, 5}
set_2 = {4, 6, 5, 10}
logical_dif = set_1.symmetric_difference(set_2)
print("Set:", logical_dif)
sum_log_dif = sum(logical_dif)
print("суму елементів двох множин:", sum_log_dif)


# task 9. Створіть два списки та обробіть їх так, щоб от,  які зустрічаються тількримати сет, який
# містить всі елементи з обох списківи один раз.
# Наприклад, якщо перший список містить [1, 2, 3, 4], а другий
# список містить [3, 4, 5, 6], то повернутий сет містить [1, 2, 5, 6]
list_1 = [1, 2, 3, 4]
list_2 = [3, 4, 5, 6]
logical_sym_dif = set(list(list_1)).symmetric_difference(set(list(list_2)))
print("сет, який містить всі елементи з обох списківи один раз:", logical_sym_dif)


person_list = [('Alice', 25), ('Boby', 19), ('Charlie', 32),
               ('David', 28), ('Emma', 22), ('Frank', 45)]
# task 10. Обробіть список кортежів person_list, що містять ім'я та вік людей,
# так, щоб отримати словник, де ключі - вікові діапазони (10-19, 20-29 тощо),
# а значення - списки імен людей, які потрапляють в кожен діапазон.
# Приклад виводу:
# {'10-19': ['A'], '20-29': ['B', 'C', 'D'], '30-39': ['E'], '40-49': ['F']}