"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
# код вводити тут
student_age = 29 # Вік студента
student_name = "Viacheslav" # Ім'я студента
is_student = True # Чи є студент студентом :)

"""

**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
user_name = "John" # Не можна починати назву змінної з цифри
user_age = 25 # '-' сприймається як мінус
price = 100 # Не можна використовувати спец символи в назвах змінних
topic = "Math" # class зарезервоване слово, його не можно перевизначити
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
# код вводити тут
max_students_in_groupe = 30
"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
# код вводити тут
course_name = ""
course_duration = ""
course_cost = ""

"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
# код вводити тут
course_cost_per_hour = course_duration // course_cost
"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
# код вводити тут
decimal_system_number = 42
binary_system_number = 0b101010
hexadecimal_system_number = 0x2A
octal_system_number = 0o52

"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
# код вводити тут
x = 17
y = 5
print(x+y,x-y, x*y, x/y, x//y, x%y, x**y)

"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
# код вводити тут
import math
circle_area = math.pi*(7.5**2) 

"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
# код вводити тут
print(18%7,50%7,33%7,14%7)

"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
# код вводити тут
black_sea_area = 436402
azov_sea_area = 37800
sum_of_two_area = black_sea_area + azov_sea_area
print("Для того щоб дізнатись площу двох морів разом треба порахувати площу двох морів разом")
print(f"Площа Чорного моря = {black_sea_area}, а площа Азовського = {azov_sea_area}")
print(f"Сумуємо ці велечини: {black_sea_area}+{azov_sea_area} = {sum_of_two_area} км2 площа двох морів разом")

"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
# код вводити тут
my_name = Viacheslav
print(my_name[0], my_name[-1], len(my_name))

"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
# код вводити тут
task_12_string = "Would you tell me, please, which way I ought to go from here?"
print(task_12_string[0:6], task_12_string[-11])

"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
# код вводити тут
favorite_quote = """І день іде, і ніч іде.
І голову схопивши в руки,
дивуєшся, чому не йде
Апостол правди і науки!"""
print(favorite_quote)

"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
# код вводити тут
first_word = "Hello"
second_word = "World"
print(f"{first_word} {second_word}")
print(f"{first_word}, {second_word}")
print(f"{first_word}\n{second_word}")

"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
# код вводити тут
print("Рядок з \"лапками\" та зворонім слешом \\")

"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
# код вводити тут
user_name = input("Введіть ваше ім\'я:")
user_age = input("Введіть ваш вік:")
print(f"Привіт, {user_name}! Тобі {user_age} років.")

"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
# код вводити тут
photo_count = 232
one_page_max = 8
total_page_needed = photo_count // one_page_max
print(f"""Щоб дізнатися скільки сторінок знадобиться щоб вклеїти всі фото
треба розділити кількість фотографій на кількість фото на одній сторінці.
{photo_count} / {one_page_max} = {total_page_needed} сторінок.""")

"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
# код вводити тут
user_favorite_color = input("Введіть ваш улюблений колір")
user_favorite_number = input("Введіть ваше улюблене число")
print(f"Ваш улюбений колір {user_favorite_color} і улюблене число {user_favorite_number}")

"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
# код вводити тут
total_amount = 375291
first_second_storage = 250449
second_third_storage = 222950
first_storage = total_amount - second_third_storage
third_storage = total_amount - first_second_storage
second_storage = second_third_storage - third_storage
print(f"""Спершу треба порахувати кількість товарів на перщому складі
Загальна кількість {total_amount} - кількість на другому і третьому складі {second_third_storage} = {first_storage} товарів
потім аналогічним способом обчислимо кількість на третьому складі:
{total_amount} - {first_second_storage} = {third_storage} товарів.
тепер знаючи скільки товарів на першому і на третьому можна порахувати скільки товарів на другому складі:
На другому і третьому складі {second_third_storage} - кількість на третьому складі {third_storage} = {second_storage} товарів на другому складі""")

"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
# код вводити тут
pay_per_month = 1179
total_month_pay = 18
computer_price = pay_per_month * total_amount
print(f"""Для того щоб порахувати ціну комп\'ютера треба спочатку порахувати загальну кількість місяців для виплати:
один рік це 12 місяців, плюс ще пів року це 6 місяців загалом {total_month_pay} місяців
далі рахуємо ціну комп\'ютера: {total_month_pay} * {pay_per_month} = {computer_price} грн""")